#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
random_id.bucket_id: Refreshing state... [id=1NQhVYR7gkQ]
data.google_client_config.provider: Reading...
data.google_client_openid_userinfo.me: Reading...
google_storage_bucket.tf_state_bucket: Refreshing state... [id=terraform-state-d4d42155847b8244]
google_container_cluster.prod_cluster: Refreshing state... [id=projects/hackathon-climat-05/locations/europe-west1/clusters/prod-cluster]
data.google_client_config.provider: Read complete after 0s [id=projects/hackathon-climat-05/regions//zones/]
data.google_client_openid_userinfo.me: Read complete after 0s [id=181226029490-compute@developer.gserviceaccount.com]
kubernetes_namespace.argocd_namespace: Refreshing state... [id=argocd]
helm_release.argocd: Refreshing state... [id=argo-cd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.argocd is tainted, so must be replaced
-/+ resource "helm_release" "argocd" {
      ~ id                         = "argo-cd" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "v2.4.2"
              - chart       = "argo-cd"
              - name        = "argo-cd"
              - namespace   = "argocd"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - controller = {
                          - enableStatefulSet = true
                        }
                      - redis-ha   = {
                          - enabled = true
                        }
                      - repoServer = {
                          - autoscaling = {
                              - enabled     = true
                              - minReplicas = 2
                            }
                        }
                      - server     = {
                          - autoscaling = {
                              - enabled     = true
                              - minReplicas = 2
                            }
                        }
                    }
                )
              - version     = "4.9.7"
            },
        ] -> (known after apply)
        name                       = "argo-cd"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

  # kubernetes_cluster_role_binding.cluster_admin will be created
  + resource "kubernetes_cluster_role_binding" "cluster_admin" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "google-service-account-admin"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "cluster-admin"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "User"
          + name      = "181226029490-compute@developer.gserviceaccount.com"
          + namespace = "default"
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @au2001, Action: `pull_request`*